tap "atlassian/tap"
tap "buo/cask-upgrade"
tap "cloudfoundry/tap"
tap "cytopia/tap"
tap "heroku/brew"
# tap "homebrew/boneyard"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "buo/cask-upgrade"
tap "homebrew/core"
tap "homebrew/services"
tap "raggi/ale"
tap "thoughtbot/formulae"
cask "java8"
brew "ack"
brew "autoconf"
brew "automake"
brew "openssl"
brew "readline"
brew "awscli"
brew "cmake"
brew "coreutils"
brew "dos2unix"
brew "fdupes"
brew "gcc"
brew "geckodriver"
brew "git"
brew "libffi"
brew "hub"
brew "icu4c"
brew "imagemagick"
brew "jenv"
brew "jq"
brew "kubernetes-cli"
brew "libyaml"
brew "minikube"
brew "ncdu"
brew "nnn"
brew "node"
brew "pkg-config"
brew "postgresql"
brew "q"
brew "ruby-build"
brew "rbenv"
brew "rbenv-bundler"
brew "rbspy"
brew "rclone"
brew "reattach-to-user-namespace"
brew "rename"
brew "rsync"
brew "serverless"
brew "shellcheck"
brew "speedtest-cli"
brew "the_silver_searcher"
brew "tldr"
brew "tmux"
brew "vim"
brew "zsh"
brew "raggi/ale/openssl-osx-ca"
brew "thoughtbot/formulae/parity"
brew "thoughtbot/formulae/rcm"
cask "appcleaner"
cask "chromedriver"
cask "clipy"
cask "firefox"
cask "gimp"
cask "handbrake"
cask "iterm2"
cask "kap"
cask "nvalt"
cask "pgadmin4"
cask "postman"
# cask "slack"
cask "spectacle"
cask "visual-studio-code"
cask "vlc"

# updates to be added as of 1/2/22
# cask bettertouchtool #improved gestures
# cask maccy # clipboard manager alternative to clipy
# cask fsnotes # note taking app
# cask insomnia # REST and GraphQL client
# cask amethyst # like spectacle, window manager

cask "vienna" # RSS reader
cask "superproductivity" # todo list app
brew "exa" # rust built ls replacement
brew "fd" # find replacement

